[
    {
        "slug": "puffins-in-pembrokeshire",
        "title": "Puffins in Pembrokeshire",
        "body": "Puffins are unmistakable birds with their black and white bodies, their colourful beaks, and their orange legs. They breed in large colonies on coastal cliffs or offshore islands and Pembrokeshire is the perfect place to spot a puffin or two!\n\n#Where can I see them?\n\nThe best place to see puffins in Pembrokeshire is [Skomer Island](https://www.welshwildlife.org/visit/skomer-island). It is situated less than a mile off the Pembrokeshire coast and accessed via boat from Martin's Haven. You can either access the island itself and discover the puffins on land or you can take a boat trip with [Pembrokeshire Island Boat Trips](http://www.pembrokeshire-islands.co.uk/boat-trips/) and cruise around the island keeping a lookout for them nestling in the cliffs.\n\n#When is the best time to see them?\n\nThe puffins are in Pembrokeshire from April to August but the best time to see them is from mid-June to mid-July.\n\n#Puffin facts\n\nA group of puffins has several names including colony, puffinry, burrow, gathering and our personal favourite, a circus!\n\nThey have been nicknamed the 'sea parrots'.\n\nDuring the winter a puffins beak changes colour to a dull grey, not the usual bright orange we are used to seeing.\n\nPuffins can dive up to 60m underwater when searching for their favourite fish, that means not only are they great at flying but they're pretty good at swimming too.",
        "created": "2023-10-01",
        "main_image": {
            "src": "https://www.puffincottageholidays.co.uk/dmedia/smart_resized/1300_450/blog/Pembrokeshire_Puffins_2023_GLH7eJQ.jpg",
            "alt": "A puffin",
            "title": "A puffin"
        },
        "published": true,
        "tags": [{"name": "python", "label": "Python"}]
    },
    {
        "slug": "saundersfest-2023",
        "title": "SaundersFEST 2023",
        "body": "Firstly, wow what an event. We laughed, we danced, we sang, and we had an absolutely amazing time! \n\nSaundersfoot held their very own music festival, [SaundersFEST](https://www.saundersfest.co.uk/), over the weekend of July 8th, 2023. It was a three-day event bringing the local community together and attracting visitors from all around the country. It was lovely to see everyone come together to support this charitable event and enjoy themselves thoroughly - we couldn't have asked for better weather either. [Puffin Cottage Holidays](https://www.puffincottageholidays.co.uk/) are proud to have been the main accommodation partner for the event, along with [The Royal Oak](https://theroyaloaksaundersfoot.com/) as the main sponsor and [Pure West Radio](https://www.purewestradio.com/), the media partner. \n\n#The Line Up \nIt all kicked off on the harbour decking on Friday evening with ChoirFEST. The harbour was filled with the sounds of [Haverfordwest Male Voice Choir](https://www.haverfordwestmalechoir.co.uk/), [Choirs For Good](https://www.choirsforgood.com/), Cor Dysgu Cymraeg, and Footbridge who performed at Saundersfoot Sailing Club. It was a packed audience, and a delicious BBQ was served by the sailing club too. \n\nDay two was the Saturday which started with the busking at Ocean Square. Spectators enjoyed music from Morgan Evans, Iestyn Gordon and Mark Perkins. It was so great to see people stopping and listening to these fantastic artists. The gates to the cricket field opened at 12.30 and was the perfect opportunity to grab your camping chairs and picnic blankets to get the best view of the main stage. Pure West Radio were there to warm the audience up and Daz Edwards got the party going as the first act on stage followed by, [Honey Fungus](http://honeyfungusband.co.uk/), Josh Navidi, Ordio and headlining act [Sorted Ska Band](https://www.facebook.com/SortedSkaBand/). The atmosphere was electric, they sold over 1500 tickets and the whole crowd were having a fantastic time. \n\nSunday was the third and final day of [SaundersFEST](https://www.saundersfest.co.uk/) and luckily the sun was still shining! Ocean Square opened the day with busking from Elliot Evans, Saltwater and Slipway Ukes. The gates to the cricket field opened at 1pm and media sponsors Pure West Radio were on hand to get the afternoon started, followed by [Choirs For Good](https://www.choirsforgood.com/), [Old Time Sailors](https://oldtimesailors.com/), [Tenby Male Choir](http://www.tenbymalechoir.org/), Victoria Joyce, Mark Evans and finishing the weekend with a bang was [Wynne Evans BEM](https://www.wynneevans.co.uk/). \n\n#Festival treats \n\nNot only were we treated to musical delights but there were plenty of food and drink stalls to be enjoyed too. [The Copper Hog](https://www.facebook.com/people/The-Copper-Hog-Ltd/100063628745739/) were serving burgers, wraps and more, amazing pizza from [J&J's Woodfired Pizza](https://www.facebook.com/jandjwoodfiredpizza/menu/), the best crepes (and coffee!) around from [Romy's Pembrokeshire](https://www.facebook.com/romyspembrokeshire/), fantastic cocktails and gin from [Bitter's and Twist](https://www.instagram.com/bittersandtwist/), delicious doughnuts from [The Doughnut Wagon](https://www.farmcottagebakery.com/general-4) and no festival is complete without pork rolls from The Rotary Club. There was something for everyone and we certainly didn't go hungry! \n\n#What did Puffin Cottage Holidays do at SaundersFEST? \n\nAs the main accommodation sponsor, we had our very own [Puffin Cottage Holidays](https://www.puffincottageholidays.co.uk/) stall where Andy, Vicki, Mai and Tyler were on hand to speak to customers old and new over the course of the weekend! One of our owners, Shane Williams, kindly donated a signed WRU rugby ball which we raffled off to make even more money for the [SaundersFEST](https://www.saundersfest.co.uk/) charities. The littlest puffin, Ava, went on stage to announce the lucky winner on the Sunday, we were pleased to raise £135. The puffin boys held a penalty shootout at the stall which was enjoyed by all ages and the puffin girls were very excited that [Galdemglitz](https://www.instagram.com/galdemglitz/) were the stall next door, they were able to get festival ready with face paint and glitter (glitter is an absolute must at a festival!). How lucky were we to do all of this whilst enjoying the fantastic line up and juggling a very busy check in day! \n\n#SaundersFEST 2023 \n[SaundersFEST](https://www.saundersfest.co.uk/) was held as a not-for-profit event raising money for some exceptional charities, here at [Puffin Cottage Holidays](https://www.puffincottageholidays.co.uk/) we're very proud to have played a part. The [SaundersFEST](https://www.saundersfest.co.uk/) charities were Velindre Cancer Centre, Ty Hafan, Greenacres Animal Rescue and Sandy Bear. \n\nWe would like to say a special thanks to Chris Williams, the main event organiser and county councillor, who helped to make [SaundersFEST](https://www.saundersfest.co.uk/) possible. Along with his team of volunteers giving their time for free to keep costs as low as possible and ensuring the fabulous charities benefited in the biggest possible way.\n\nFor a sneak peek into the weekend check out the amazing video [Behind The Lens Media](https://behindthelensmedia.co.uk/) put together for us [here](https://www.youtube.com/watch?v=rUq9SkuWZz4). \n\nWe can't wait for next year already!",
        "created": "2023-10-01",
        "main_image": {
            "src": "https://www.puffincottageholidays.co.uk/dmedia/smart_resized/1300_450/blog/Pembrokeshire_Street_Food_Festival_2023.jpg",
            "alt": "A street food market",
            "title": "A street food market"
        },
        "published": true,
        "tags": [{"name": "python", "label": "Python"}, {"name": "flask", "label": "Flask"}]
    }
]
